app/Controllers/MahasiswaController.php

    public function create()
    {
        $modelJurusan = new Jurusan();
        $data = [
            'title' => 'Tambah Mahasiswa',
            'jurusan' => $modelJurusan->findAll()
---
SELECT *
FROM `jurusan`

    public function store()
    {
        $model = new Mahasiswa();

        // Mengambil file foto
        $foto = $this->request->getFile('foto');
        if ($foto->isValid() && !$foto->hasMoved()) {
            $fotoName = $foto->getRandomName();
            $foto->move('uploads/foto', $fotoName);
        } else {
            // Jika foto gagal diupload
            session()->setFlashdata('error', 'Foto gagal diupload.');
            return redirect()->to('/mahasiswa/tambah')->withInput();
        }

        // Mengambil data dari form
        $data = [
            'nim'           => $this->request->getPost('nim'),
            'nama'          => $this->request->getPost('nama'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'jurusan_id'    => $this->request->getPost('jurusan_id'),
            'alamat'        => $this->request->getPost('alamat'),
            'no_telepon'    => $this->request->getPost('no_telepon'),
            'foto'          => $fotoName,
        ];



        // Simpan data ke database
        if ($model->save($data)) {
---
INSERT INTO `mahasiswa` (`nim`, `nama`, `jenis_kelamin`, `jurusan_id`, `alamat`, `no_telepon`, `foto`, `created_at`, `updated_at`) VALUES ('220231006577', 'rafi', 'L', '2', 'serdytfugihojpiouigy', '09876543456', '1732178849_4d4161f9ec9b785cc5ba.jpeg', '2024-11-21 08:47:29', '2024-11-21 08:47:29')

    public function edit($id)
    {
        $mahasiswaModel = new Mahasiswa();
        $jurusanModel = new Jurusan();

        $mahasiswa = $mahasiswaModel->find($id);

        if (!$mahasiswa) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Mahasiswa dengan ID $id tidak ditemukan.");
        }

        $jurusan = $jurusanModel->findAll();
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '1'
SELECT *
FROM `jurusan`