app/Models/Mahasiswa.php

SELECT `mahasiswa`.*, `jurusan`.`nama_jurusan`
FROM `mahasiswa`
JOIN `jurusan` ON `jurusan`.`id` = `mahasiswa`.`jurusan_id`
---
    public function getAllMahasiswa()
    {
        return $this->select('mahasiswa.*, jurusan.nama_jurusan')
            ->join('jurusan', 'jurusan.id = mahasiswa.jurusan_id')
            ->findAll();